In [1]:
import pandas as pd
import numpy as np 
from sklearn.model_selection import train_test_split

In [7]:
dataset_split = pd.read_csv("dataset.csv")
dataset_split

,Unnamed: 0,Make,Year of manufacture,Condition,Mileage,Engine Size,Fuel,Transmission,Price,Build
0,0,Toyota,2007.0,Nigerian Used,166418.0,2400.0,Petrol,Automatic,"3,120,000",NaN
1,1,Lexus,NaN,NaN,138024.0,NaN,NaN,Automatic,"5,834,000",NaN
2,2,Mercedes-Benz,2008.0,Nigerian Used,376807.0,3000.0,Petrol,Automatic,"3,640,000",NaN
3,3,Lexus,NaN,NaN,213362.0,NaN,NaN,Automatic,"3,594,000",NaN
4,4,Mercedes-Benz,NaN,NaN,106199.0,NaN,NaN,Automatic,"8,410,000",NaN
...,...,...,...,...,...,...,...,...,...,...
4090,4090,Honda,2004.0,Nigerian Used,207446.0,3500.0,Petrol,Automatic,"1,125,000",NaN
4091,4091,Toyota,2005.0,Nigerian Used,106914.0,1800.0,Petrol,Automatic,"2,643,750",NaN
4092,4092,Honda,2006.0,Nigerian Used,247149.0,1800.0,Petrol,Automatic,"1,462,500",NaN
4093,4093,Toyota,2007.0,Nigerian Used,249325.0,2500.0,Petrol,Automatic,"2,475,000",NaN
4094,4094,Toyota,2013.0,Foreign Used,235184.0,2500.0,Petrol,Automatic,"6,300,000",NaN

## Nilai Null

In [3]:
dataset_split.isna().sum()

Unnamed: 0                0
Make                      0
Year of manufacture     478
Condition               479
Mileage                  71
Engine Size             511
Fuel                    488
Transmission             20
Price                     0
Build                  2968
dtype: int64

## Membuat data split

In [5]:
X = dataset_split.iloc[:,:-1]
y = dataset_split.iloc[:,-1]

X_train, X_test, y_train, y_test = train_test_split(X, y, test_size = 0.3)

In [6]:
df=pd.read_csv("copy.csv")

In [8]:
from sklearn.impute import SimpleImputer
imputer = SimpleImputer(strategy="mean")

In [10]:
df["Year of manufacture"]=imputer.fit_transform(df[["Year of manufacture"]])
df["Mileage"]=imputer.fit_transform(df[["Mileage"]])
df["Engine Size"]=imputer.fit_transform(df[["Engine Size"]])

In [12]:
df.isna().sum()

Unnamed: 0                0
Make                      0
Year of manufacture       0
Condition               479
Mileage                   0
Engine Size               0
Fuel                    488
Transmission             20
Price                     0
Build                  2968
dtype: int64

## Membersihkan attribut yang lain yang memiliki null

In [13]:
from sklearn.impute import SimpleImputer
imputer = SimpleImputer(strategy="most_frequent")

In [14]:
df["Condition"]=imputer.fit_transform(df[["Condition"]])
df["Fuel"]=imputer.fit_transform(df[["Fuel"]])
df["Transmission"]=imputer.fit_transform(df[["Transmission"]])
df["Build"]=imputer.fit_transform(df[["Build"]])

In [15]:
df.isna().sum()

Unnamed: 0             0
Make                   0
Year of manufacture    0
Condition              0
Mileage                0
Engine Size            0
Fuel                   0
Transmission           0
Price                  0
Build                  0
dtype: int64

## Mengatasi Nilai Duplicate

In [16]:
df[df.duplicated()]

Empty DataFrame
Columns: [Unnamed: 0, Make, Year of manufacture, Condition, Mileage, Engine Size, Fuel, Transmission, Price, Build]
Index: []

## Melakukan Normalisasi pada data

In [17]:
from sklearn.preprocessing import MinMaxScaler

In [18]:
min_max_scaler = MinMaxScaler()

In [20]:
x_scaled = min_max_scaler.fit_transform(
    df[['Mileage']]
)

In [21]:
data_normalization = pd.DataFrame(x_scaled)
data_normalization.head()

          0
0  0.016682
1  0.013835
2  0.037771
3  0.021387
4  0.010645

## Mengubah Tipe data attribute angka

In [24]:
dfubah = df[["Price"]].astype("object") 
dfubah["Price"].dtypes

dtype('O')

## one-hot encoding

In [25]:
from sklearn.preprocessing import OneHotEncoder
onehotencoder = OneHotEncoder(sparse=False)

In [26]:
onehot = onehotencoder.fit_transform(df[['Fuel']])
dfonehot= pd.DataFrame(onehot)
dfonehot.head(10)

     0    1    2    3
0  0.0  0.0  0.0  1.0
1  0.0  0.0  0.0  1.0
2  0.0  0.0  0.0  1.0
3  0.0  0.0  0.0  1.0
4  0.0  0.0  0.0  1.0
5  0.0  0.0  0.0  1.0
6  0.0  0.0  0.0  1.0
7  0.0  0.0  0.0  1.0
8  0.0  0.0  0.0  1.0
9  0.0  0.0  0.0  1.0